harmonium-HSP/arcfour/examples/arm/stm32l4_power_example.c
/*
 * STM32L4 Low Power Example with RC4 Power-Aware API
 * 
 * This example demonstrates how to use the power-aware encryption API
 * on STM32L4 microcontrollers, which feature ultra-low power modes.
 * 
 * Note: Requires STM32 HAL Library for full functionality.
 * When not available, a simulation mode is used for compilation.
 */

#include <stdint.h>
#include <stdarg.h>
#include <stdio.h>
#include <string.h>

/* Try to include STM32 HAL header, or provide simulation definitions */
#ifdef USE_STM32_HAL
#  include "stm32l4xx_hal.h"
#else
/* Simulation definitions for compilation without STM32 HAL */
#  define __IO volatile
#  define HAL_StatusTypeDef int
#  define HAL_OK 0
#  define HAL_ERROR -1
#  define HAL_MAX_DELAY 0xFFFFFFFFU
#  define ENABLE 1
#  define DISABLE 0

/* HAL Status */
typedef enum {
    HAL_STATE_RESET = 0x00U,
    HAL_STATE_READY = 0x01U,
    HAL_STATE_BUSY = 0x02U,
    HAL_STATE_TIMEOUT = 0x03U,
    HAL_STATE_ERROR = 0x04U
} HAL_StateTypeDef;

/* UART simulation */
typedef struct {
    uint32_t CR1;
    uint32_t CR2;
    uint32_t CR3;
    uint32_t BRR;
    uint32_t GTPR;
    uint32_t RTOR;
    uint32_t RQR;
    uint32_t ISR;
    uint32_t ICR;
    uint32_t RDR;
    uint32_t TDR;
} USART_TypeDef;

typedef struct {
    USART_TypeDef* Instance;
    HAL_StateTypeDef State;
} UART_HandleTypeDef;

#  define USART2 ((USART_TypeDef*)0x40004400U)

/* RNG simulation */
typedef struct {
    uint32_t CR;
    uint32_t SR;
    uint32_t DR;
} RNG_TypeDef;

typedef struct {
    RNG_TypeDef* Instance;
    HAL_StateTypeDef State;
} RNG_HandleTypeDef;

RNG_HandleTypeDef hrng;

/* ADC simulation */
typedef struct {
    uint32_t CR;
    uint32_t CFGR;
    uint32_t SMPR1;
    uint32_t SMPR2;
    uint32_t JOFR1;
    uint32_t JOFR2;
    uint32_t JOFR3;
    uint32_t JOFR4;
    uint32_t HTR;
    uint32_t LTR;
    uint32_t SQR1;
    uint32_t SQR2;
    uint32_t SQR3;
    uint32_t SQR4;
    uint32_t DR;
    uint32_t CR2;
} ADC_TypeDef;

typedef struct {
    uint32_t ClockPrescaler;
    uint32_t Resolution;
    uint32_t ScanConvMode;
    uint32_t ContinuousConvMode;
    uint32_t DiscontinuousConvMode;
    uint32_t ExternalTrigConvEdge;
    uint32_t ExternalTrigConv;
    uint32_t DataAlign;
    uint32_t NbrOfConversion;
    uint32_t DMAContinuousRequests;
    uint32_t EOCSelection;
} ADC_InitTypeDef;

typedef struct {
    ADC_TypeDef* Instance;
    ADC_InitTypeDef Init;
    HAL_StateTypeDef State;
} ADC_HandleTypeDef;

typedef struct {
    uint32_t Channel;
    uint32_t Rank;
    uint32_t SamplingTime;
} ADC_ChannelConfTypeDef;

#  define ADC1 ((ADC_TypeDef*)0x40012000U)
#  define ADC_CHANNEL_VREFINT 18
#  define ADC_CLOCK_SYNC_PCLK_DIV4 0
#  define ADC_RESOLUTION_12B 0
#  define ADC_SAMPLETIME_640CYCLES_5 7
#  define ADC_REGULAR_RANK_1 1
#  define ADC_EXTERNALTRIGCONVEDGE_NONE 0
#  define ADC_SOFTWARE_START 0
#  define ADC_DATAALIGN_RIGHT 0
#  define ADC_EOC_SINGLE_CONV 0

/* RCC simulation */
typedef struct {
    uint32_t CR;
    uint32_t CFGR;
    uint32_t CIR;
    uint32_t APB2RSTR;
    uint32_t APB1RSTR;
    uint32_t AHBENR;
    uint32_t APB2ENR;
    uint32_t APB1ENR;
    uint32_t BDCR;
    uint32_t CSR;
    uint32_t CRRCR;
    uint32_t CCIPR;
    uint32_t BDCR2;
} RCC_TypeDef;

#  define RCC ((RCC_TypeDef*)0x40021000U)
#  define RCC_CFGR_SW 0x03
#  define RCC_CFGR_SW_HSI 0x01
#  define RCC_CFGR_SWS 0x0C
#  define RCC_CFGR_SWS_HSI 0x04
#  define RCC_FLAG_HSIRDY 0x02
#  define RCC_OSCILLATORTYPE_HSI 0x01
#  define RCC_HSI_ON 0x01
#  define RCC_PLL_ON 0x01
#  define RCC_PLLSOURCE_HSI 0x00
#  define RCC_PLLP_DIV2 0x00
#  define RCC_SYSCLKSOURCE_PLLCLK 0x03
#  define RCC_SYSCLK_DIV1 0x00
#  define RCC_HCLK_DIV1 0x00
#  define RCC_CLOCKTYPE_HCLK 0x01
#  define RCC_CLOCKTYPE_SYSCLK 0x02
#  define RCC_CLOCKTYPE_PCLK1 0x04
#  define RCC_CLOCKTYPE_PCLK2 0x08
#  define FLASH_LATENCY_4 0x04

typedef struct {
    uint32_t OscillatorType;
    uint32_t HSIState;
    uint32_t HSICalibrationValue;
    struct {
        uint32_t PLLState;
        uint32_t PLLSource;
        uint32_t PLLM;
        uint32_t PLLN;
        uint32_t PLLP;
        uint32_t PLLQ;
    } PLL;
} RCC_OscInitTypeDef;

typedef struct {
    uint32_t ClockType;
    uint32_t SYSCLKSource;
    uint32_t AHBCLKDivider;
    uint32_t APB1CLKDivider;
    uint32_t APB2CLKDivider;
} RCC_ClkInitTypeDef;

/* PWR simulation */
#  define PWR_REGULATOR_VOLTAGE_SCALE1 0x00
#  define PWR_STOPENTRY_WFI 0x01
#  define RCC_HSICALIBRATION_DEFAULT 0x10

/* Forward function declarations */
void SystemClock_Config(void);
void MX_GPIO_Init(void);
void MX_USART2_UART_Init(void);
void MX_RNG_Init(void);

/* Function prototypes */
void HAL_UART_Transmit(UART_HandleTypeDef* huart, uint8_t* pData, uint16_t Size, uint32_t Timeout);
void HAL_RNG_GenerateRandomNumber(RNG_HandleTypeDef* hrng, uint32_t* random);
HAL_StatusTypeDef HAL_ADC_Init(ADC_HandleTypeDef* hadc);
HAL_StatusTypeDef HAL_ADC_ConfigChannel(ADC_HandleTypeDef* hadc, ADC_ChannelConfTypeDef* sConfig);
HAL_StatusTypeDef HAL_ADC_Start(ADC_HandleTypeDef* hadc);
HAL_StatusTypeDef HAL_ADC_PollForConversion(ADC_HandleTypeDef* hadc, uint32_t Timeout);
uint32_t HAL_ADC_GetValue(ADC_HandleTypeDef* hadc);
HAL_StatusTypeDef HAL_ADC_Stop(ADC_HandleTypeDef* hadc);
void HAL_Init(void);
void HAL_Delay(uint32_t Delay);
void HAL_PWREx_EnterSTOP2Mode(uint32_t PWR_STOPENTRY);
HAL_StatusTypeDef HAL_RCC_OscConfig(RCC_OscInitTypeDef* RCC_OscInitStruct);
HAL_StatusTypeDef HAL_RCC_ClockConfig(RCC_ClkInitTypeDef* RCC_ClkInitStruct, uint32_t FLASH_Latency);
void __HAL_RCC_HSI_ENABLE(void);
uint32_t __HAL_RCC_GET_FLAG(uint32_t RCC_FLAG);
void __HAL_RCC_GPIOA_CLK_ENABLE(void);
void __HAL_RCC_USART2_CLK_ENABLE(void);
void __HAL_RCC_USART2_CLK_DISABLE(void);
void __HAL_RCC_GPIOA_CLK_DISABLE(void);
void __HAL_RCC_PWR_CLK_ENABLE(void);
void __HAL_PWR_VOLTAGESCALING_CONFIG(uint32_t VoltageScaling);

#endif

#include "arcfour_power.h"
#include "arcfour.h"

/* UART Handle */
UART_HandleTypeDef huart2;

/* Power management hooks */
arcfour_power_hooks_t stm32l4_hooks;

/* UART Printf function */
void uart_printf(const char* format, ...) {
    char buffer[256];
    va_list args;
    va_start(args, format);
    vsnprintf(buffer, sizeof(buffer), format, args);
    va_end(args);
    HAL_UART_Transmit(&huart2, (uint8_t*)buffer, strlen(buffer), HAL_MAX_DELAY);
}

/* Wakeup handler - enable peripherals and full clock */
static int stm32l4_wakeup_handler(void) {
    /* Enable HSI clock for full performance */
    __HAL_RCC_HSI_ENABLE();
    while (!(__HAL_RCC_GET_FLAG(RCC_FLAG_HSIRDY)));
    
    /* Switch system clock to HSI */
    RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_HSI;
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSI);
    
    /* Enable peripherals */
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_USART2_CLK_ENABLE();
    
    uart_printf("Woke up\n");
    return 0;
}

/* Sleep handler - enter STOP 2 mode */
static void stm32l4_sleep_handler(void) {
    uart_printf("Entering STOP mode...\n");
    
    /* Disable peripherals */
    __HAL_RCC_USART2_CLK_DISABLE();
    __HAL_RCC_GPIOA_CLK_DISABLE();
    
    /* Configure for STOP 2 mode */
    HAL_PWREx_EnterSTOP2Mode(PWR_STOPENTRY_WFI);
    
    /* After wakeup, reconfigure clock */
    SystemClock_Config();
}

/* Low battery handler - reduce performance */
static int stm32l4_low_battery_handler(uint16_t voltage_mv) {
    uart_printf("Low battery: %d mV\n", voltage_mv);
    
    if (voltage_mv < 2000) {
        /* Critical low battery - abort operation */
        return 0;
    } else if (voltage_mv < 2500) {
        /* Low battery - continue but warn */
        uart_printf("Warning: Reduced performance mode\n");
        return 1;
    }
    
    return 1;  /* Normal operation */
}

/* Read battery voltage using ADC */
uint16_t arcfour_read_battery_mv(void) {
    static ADC_HandleTypeDef hadc;
    
    /* ADC configuration for battery measurement */
    hadc.Instance = ADC1;
    hadc.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
    hadc.Init.Resolution = ADC_RESOLUTION_12B;
    hadc.Init.ScanConvMode = DISABLE;
    hadc.Init.ContinuousConvMode = DISABLE;
    hadc.Init.DiscontinuousConvMode = DISABLE;
    hadc.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
    hadc.Init.ExternalTrigConv = ADC_SOFTWARE_START;
    hadc.Init.DataAlign = ADC_DATAALIGN_RIGHT;
    hadc.Init.NbrOfConversion = 1;
    hadc.Init.DMAContinuousRequests = DISABLE;
    hadc.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
    HAL_ADC_Init(&hadc);
    
    /* Configure channel for internal reference voltage */
    ADC_ChannelConfTypeDef sConfig = {0};
    sConfig.Channel = ADC_CHANNEL_VREFINT;
    sConfig.Rank = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = ADC_SAMPLETIME_640CYCLES_5;
    HAL_ADC_ConfigChannel(&hadc, &sConfig);
    
    /* Start conversion */
    HAL_ADC_Start(&hadc);
    HAL_ADC_PollForConversion(&hadc, HAL_MAX_DELAY);
    
    /* Read result */
    uint32_t adc_value = HAL_ADC_GetValue(&hadc);
    
    /* Calculate voltage (VREFINT_CAL is stored in FLASH) */
    uint32_t vrefint_cal = *(uint32_t*)0x1FFF75AA;
    uint16_t voltage_mv = (3300 * vrefint_cal) / adc_value;
    
    HAL_ADC_Stop(&hadc);
    
    return voltage_mv;
}

/* Encryption test with power management */
void power_aware_encryption_test(void) {
    uint8_t key[32];
    uint8_t plaintext[64] = "STM32L4 Low Power Encryption Test";
    uint8_t ciphertext[64];
    uint8_t decrypted[64];
    
    /* Generate random key */
    HAL_RNG_GenerateRandomNumber(&hrng, (uint32_t*)key);
    HAL_RNG_GenerateRandomNumber(&hrng, (uint32_t*)(key + 4));
    
    uart_printf("\n=== Power-Aware Encryption Test ===\n");
    
    /* Initialize with power management */
    arcfour_ctx* ctx = arcfour_init_power_aware(key, 32, &stm32l4_hooks);
    if (!ctx) {
        uart_printf("❌ Initialization failed\n");
        return;
    }
    
    /* Power-aware encryption */
    int result = arcfour_encrypt_power_aware(ctx, plaintext, ciphertext, 64, &stm32l4_hooks);
    if (result != 0) {
        uart_printf("❌ Encryption failed (%d)\n", result);
        arcfour_uninit(ctx);
        return;
    }
    
    uart_printf("✅ Encryption successful\n");
    
    /* Decrypt to verify */
    arcfour_ctx* ctx2 = arcfour_init(key, 32);
    arcfour_decrypt(ctx2, ciphertext, decrypted, 64);
    
    if (memcmp(plaintext, decrypted, 64) == 0) {
        uart_printf("✅ Decryption verified\n");
    } else {
        uart_printf("❌ Decryption failed\n");
    }
    
    arcfour_uninit(ctx);
    arcfour_uninit(ctx2);
}

int main(void) {
    /* Initialize HAL */
    HAL_Init();
    
    /* Configure system clock */
    SystemClock_Config();
    
    /* Initialize peripherals */
    MX_GPIO_Init();
    MX_USART2_UART_Init();
    MX_RNG_Init();
    
    /* Configure power management hooks */
    stm32l4_hooks.before_operation = stm32l4_wakeup_handler;
    stm32l4_hooks.after_operation = stm32l4_sleep_handler;
    stm32l4_hooks.on_low_battery = stm32l4_low_battery_handler;
    stm32l4_hooks.timeout_ms = 5000;  /* 5 second auto-sleep */
    
    /* Set as global hooks */
    arcfour_set_global_power_hooks(&stm32l4_hooks);
    
    uart_printf("========== STM32L4 Power-Aware RC4 ==========\n");
    
    while (1) {
        /* Run encryption test */
        power_aware_encryption_test();
        
        /* Check if we should sleep */
        if (arcfour_should_sleep(&stm32l4_hooks)) {
            uart_printf("Auto-sleep triggered\n");
            stm32l4_sleep_handler();
        }
        
        /* Wait before next cycle */
        HAL_Delay(1000);
    }
}

/* System Clock Configuration */
void SystemClock_Config(void) {
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
    RCC_OscInitStruct.PLL.PLLM = 8;
    RCC_OscInitStruct.PLL.PLLN = 80;
    RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
    RCC_OscInitStruct.PLL.PLLQ = 4;
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
    HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4);
}

/* Peripheral initialization functions */
void MX_GPIO_Init(void) { /* ... */ }
void MX_USART2_UART_Init(void) { /* ... */ }
void MX_RNG_Init(void) { /* ... */ }

/* Simulation implementations (only used when STM32 HAL is not available) */
#ifndef USE_STM32_HAL

static uint32_t g_rng_seed = 0x12345678;
static uint32_t g_adc_value = 2048;  /* Mid-scale value for simulation */

void HAL_UART_Transmit(UART_HandleTypeDef* huart, uint8_t* pData, uint16_t Size, uint32_t Timeout) {
    (void)huart;
    (void)Timeout;
}

void HAL_RNG_GenerateRandomNumber(RNG_HandleTypeDef* hrng, uint32_t* random) {
    (void)hrng;
    g_rng_seed = g_rng_seed * 1103515245 + 12345;
    *random = g_rng_seed;
}

HAL_StatusTypeDef HAL_ADC_Init(ADC_HandleTypeDef* hadc) {
    (void)hadc;
    return HAL_OK;
}

HAL_StatusTypeDef HAL_ADC_ConfigChannel(ADC_HandleTypeDef* hadc, ADC_ChannelConfTypeDef* sConfig) {
    (void)hadc;
    (void)sConfig;
    return HAL_OK;
}

HAL_StatusTypeDef HAL_ADC_Start(ADC_HandleTypeDef* hadc) {
    (void)hadc;
    return HAL_OK;
}

HAL_StatusTypeDef HAL_ADC_PollForConversion(ADC_HandleTypeDef* hadc, uint32_t Timeout) {
    (void)hadc;
    (void)Timeout;
    return HAL_OK;
}

uint32_t HAL_ADC_GetValue(ADC_HandleTypeDef* hadc) {
    (void)hadc;
    return g_adc_value;
}

HAL_StatusTypeDef HAL_ADC_Stop(ADC_HandleTypeDef* hadc) {
    (void)hadc;
    return HAL_OK;
}

void HAL_Init(void) {
}

void HAL_Delay(uint32_t Delay) {
    (void)Delay;
}

void HAL_PWREx_EnterSTOP2Mode(uint32_t PWR_STOPENTRY) {
    (void)PWR_STOPENTRY;
}

HAL_StatusTypeDef HAL_RCC_OscConfig(RCC_OscInitTypeDef* RCC_OscInitStruct) {
    (void)RCC_OscInitStruct;
    return HAL_OK;
}

HAL_StatusTypeDef HAL_RCC_ClockConfig(RCC_ClkInitTypeDef* RCC_ClkInitStruct, uint32_t FLASH_Latency) {
    (void)RCC_ClkInitStruct;
    (void)FLASH_Latency;
    return HAL_OK;
}

void __HAL_RCC_HSI_ENABLE(void) {
}

uint32_t __HAL_RCC_GET_FLAG(uint32_t RCC_FLAG) {
    (void)RCC_FLAG;
    return 1;
}

void __HAL_RCC_GPIOA_CLK_ENABLE(void) {
}

void __HAL_RCC_USART2_CLK_ENABLE(void) {
}

void __HAL_RCC_USART2_CLK_DISABLE(void) {
}

void __HAL_RCC_GPIOA_CLK_DISABLE(void) {
}

void __HAL_RCC_PWR_CLK_ENABLE(void) {
}

void __HAL_PWR_VOLTAGESCALING_CONFIG(uint32_t VoltageScaling) {
    (void)VoltageScaling;
}

#endif /* USE_STM32_HAL */